Repository: cakephp/cakephp.org
Catalog: src/Locale/*/default.po
Languages: pt_br

source: Don't have a ticket yet? Only a limited amount are available, so purchase yours today! From a wide range of talks, interactive workshops to prizes, giveaways and fun social activities all planned over 4 exciting days!
pt_br: Ainda não tem um ticket? Apenas uma quantidade limitada está disponível, então adquira seu hoje! Uma vasta gama de palestras, workshops interativos, prêmios, brindes e atividades sociais divertidas estão planejadas ao longo de 4 dias emocionantes!

source: Buy Your Tickets
pt_br: Compre Seus Tickets

source: Get your ticket!
pt_br: Participe!

source: Sign up for our newsletter.
pt_br: Assine nossa newsletter.

source: First Name
pt_br: Nome

source: Last Name
pt_br: Sobrenome

source: Email Format
pt_br: Formato do Email

source: Send!
pt_br: Enviar!

source: Hear what others have to say.
pt_br: Ouça o que outros tem a dizer.

source: This is how CakePHP has helped others to succeed.
pt_br: É assim que o CakePHP os auxiliou a alcançar o sucesso.

source: Sharing the cake.
pt_br: Dividindo o bolo.

source: Get involved and support the community.
pt_br: Envolva-se e ajude a comunidade de desenvolvedores.

source: Learn more.
pt_br: Conte-me mais sobre isso.

source: Companies using CakePHP
pt_br: Companias usando o CakePHP

source: View the Showcase
pt_br: Veja nosso mostruário

source: CakePHP makes building web applications simpler, faster, while requiring less code. A modern PHP 5.5+ framework offering a flexible database access layer and a powerful scaffolding system that makes building both small and complex systems simpler, easier and, of course, tastier. Build fast, grow solid with CakePHP.
pt_br: O CakePHP simplifica e agiliza a construção de aplicações web, tanto pequenas quanto complexas, diminuindo a quantidade de código a ser escrito. Um moderno framework baseado no PHP 5.5+ que oferece uma camada flexível de acesso a bancos de dados e um sistema de scaffolding poderoso, e, naturalmente, torna a experiência mais saborosa. Construa rápido, seja consistente com o CakePHP.

source: A recipe to succeed.
pt_br: Receita para o sucesso.

source: Prototype faster, Validate faster, Grow consistently.
pt_br: Prototipe e valide rapidamente, cresça de forma consistente.

source: Build Quickly
pt_br: Construa Rápido

source: Use code generation and scaffolding features to {0}.
pt_br: Use a geração de código e as características de scaffolding para {0}.

source: rapidly build prototypes
pt_br: construir protótipos rapidamente

source: No Configuration
pt_br: Configuração Simplificada

source: No complicated XML or YAML files. Just setup your database and you're {0}.
pt_br: Sem arquivos XMS ou YAML complicados. Apenas configure seu banco de dados e você está {0}.

source: ready to bake
pt_br: pronto para assar

source: Friendly License
pt_br: Licença Amigável

source: CakePHP is licensed under the MIT license which makes it perfect for use in {0}.
pt_br: CakePHP é licenciado sob a licença MIT que o torna perfeito para uso em {0}.

source: Commercial applications
pt_br: aplicações comerciais

source: Batteries Included
pt_br: Pilhas Inclusas

source: {0}. Translations, database access, caching, validation, authentication, and much more are all built into one of the original PHP MVC frameworks.
pt_br: {0}. Traduções, acesso a banco de dados, caching, validação, autenticação, e muito mais está incluso em um dos frameworks PHP MVC originais.

source: The things you need are built-in
pt_br: Os ingredientes que você precisa, estão incluídos

source: Clean MVC Conventions
pt_br: Convenções MVC Transparentes

source: Instead of having to plan where things go, CakePHP comes with a {0} to guide you in developing your application
pt_br: Em vez de ter que planejar para onde as coisas vão, o CakePHP vem com uma {0} para guiá-lo no desenvolvimento de sua aplicação

source: set of conventions
pt_br: coleção de convenções

source: Secure
pt_br: Seguro

source: CakePHP comes with built-in tools for input validation, CSRF protection, Form tampering protection, SQL injection prevention, and XSS prevention, helping you keep your application {0}.
pt_br: O CakePHP vem com ferramentas nativas de validação de entrada, proteção CSRF, proteção contra adulteração de formulários, prevenção contra injeção SQL e XSS, ajudando sua aplicação a permanecer {0}.

source: safe & secure.
pt_br: fora de perigo & segura.

source: Premium
pt_br: Suporte

source: Support
pt_br: Premium

source: Give "The Experts Behind CakePHP" a call:
pt_br: Faça uma ligação para "Os Experts Por Trás do CakePHP":

source: Meet CakeDC.
pt_br: Conheça a CakeDC.

source: The commercial entity behind the framework, and established by Larry Masters, founder of CakePHP, we know your project like no one else. From startups and social networks, to e-commerce and enterprise level applications, we provide the highest quality CakePHP development available.
pt_br: Como a entidade comercial por trás do framework, e criada por Larry Masters, fundador do CakePHP, conhecemos a fundação do seu projeto como ninguém. De startups e redes sociais, aplicações de nível empresarial a e-commerces, nós fornecemos a mais alta qualidade no que tange desenvolvimento com o framework CakePHP.

source: Request a rapid response from us now, and we'll contact you within 24 hours:
pt_br: Solicite uma resposta rápida agora, e nós vamos contata-lo em até 24 horas.

source: Rapid Response
pt_br: Contato Rápido

source: Read more
pt_br: Leia mais

source: Professional support for CakePHP is provided by our professional services partner, the Cake Development Corporation.
pt_br: O suporte profissional ao CakePHP é fornecido pelo nosso parceiro de ofertas comerciais, a Cake Development Corporation.

source: Learn the insights and reasoning behind the CakePHP framework straight from the minds behind the framework: the developers at CakeDC
pt_br: Aprenda com as considerações e raciocínio diretamente das mentes por trás do quadro de desenvolvedores da CakeDC.

source: Expert {0} Consultancy
pt_br: Consultoria {0} Especializada

source: We can help with the areas which need special attention and a trained eye, allowing you to rest assured that you've got all bases covered.
pt_br: Nós podemos ajudar com as áreas que precisam de atenção especial e um olho treinado, o que lhe permite ter a certeza de que você tem todas as bases cobertas.

source: Rapid
pt_br: Contato

source: Response
pt_br: Rápido

source: Request a rapid response from us now, and we'll contact you within {0}
pt_br: Solicite uma resposta expressa agora, e nós vamos contata-lo em até {0}.

source: 5. And the unique visual styling of our website and packaging (the "Trade Dress").
pt_br: 5. E o estilo visual único do nosso website e embalagens (o "Trade Dress").

source: 5.1. Brand colors.
pt_br: 5.1. Cores da marca.

source: 5.1.1 Sister Brand Colors. - CakeDC
pt_br: 5.1.1 Cores da marca irmã. - CakeDC

source: 5.1.2 Sister Brand Colors. - CakeSF
pt_br: 5.1.2 Cores da marca irmã. - CakeSF

source: 5.1.3 Sister Brand Colors. - CakeFest
pt_br: 5.1.3 Cores da marca irmã. - CakeFest

source: 5.1.4 Sister Brand Colors. - CakeTalent
pt_br: 5.1.4 Cores da marca irmã. - CakeTalent

source: 5.1.5 Sister Brand Colors. - CakeJobs
pt_br: 5.1.5 Cores da marca irmã. - CakeJobs

source: 5.1.6 Sister Brand Colors. - CakeUniversity
pt_br: 5.1.6 Cores da marca irmã. - CakeUniversity

source: Our commitment to open source principles
pt_br: Nosso compromisso com os princípios de código aberto

source: We want to encourage and facilitate the use of our trademarks by the community, but do so in a way that still ensures that the trademarks are meaningful as a source and quality indicator for our software and the associated goods and services and continue to embody the high reputation of the software and the community associated with it. This Policy therefore tries to strike the proper balance between: 1) our need to ensure that our trademarks remain reliable indicators of the qualities that they are meant to preserve and 2) our community members' desire to be full participants in the Project.
pt_br: Queremos incentivar e facilitar o uso de nossas marcas registradas pela comunidade, mas fazê-lo de uma forma que ainda garanta que as marcas são significativas como fonte e indicador de qualidade para o nosso software e os bens e serviços associados e continuar a encarnar a alta reputação do software e da comunidade associada a ele. Esta Política, portanto, procura estabelecer um equilíbrio adequado entre: 1) nossa necessidade de assegurar que nossas marcas permaneçam como indicadores confiáveis ​d​as qualidades que elas devem preservar e 2) o desejo de nossos membros da comunidade de participar plenamente no Projeto.

source: 1. Group Flag: The Group Flag is used to show plural form of usage. Example, you are a company or group of developers wanting to let others know you use CakePHP.
pt_br: 1. Bandeira de Grupo: A Bandeira de Grupo é usada para denotar uso pluralizado. Por exemplo, você é uma empresa ou grupo de desenvolvedores que deseja que os outros saibam que você usa o CakePHP.

source: Floating Flag Embed Code:
pt_br: Código de Incorporação:

source: Image files:
pt_br: Arquivos de imagem:

source: 2. Application Flag: The Application Flag is used to show that your have built an application that is using CakePHP.
pt_br: 2. Bandeira de Aplicação: A Bandeira de Aplicação é usada para mostrar que uma aplicação foi construída usando o CakePHP.

source: 3. Developer Flag: The Developer Flag is used by individuals to show their support for the project and that they are using CakePHP.
pt_br: 3. Bandeira de Desenvolvedor: A Bandeira de Desenvolvedor é usada por indivíduos que desejam demonstrar seu suporte ao projeto e que eles estão usando o CakePHP.

source: 4. Supporter Flag: The Supporter Flag is used to spread the word about CakePHP and tell them to use CakePHP.
pt_br: 4. Bandeira de Apoiador: A Bandeira de Apoiador é usada para fomentar o CakePHP e recomendar o uso do mesmo.

source: General considerations about trademarks and their use
pt_br: Considerações gerais sobre marcas comerciais e às suas utilizações

source: What trademark law is about
pt_br: Do direito das marcas

source: What is a trademark?
pt_br: O que é uma marca?

source: A trademark is a word, phrase, symbol or design, or a combination of words, phrases, symbols or designs, that identifies and distinguishes the source of the goods of one party from those of others. A service mark is the same as a trademark, except that it identifies and distinguishes the source of a service rather than a product. "Trade dress" or "get up" refers to the look and feel of the packaging, which in this context can include the layout, colors, images, and design choices in a web page. Throughout this Policy, the terms "trademark" and "mark" refer to both trademarks, service marks and trade dress.
pt_br: Uma marca comercial é uma palavra, frase, símbolo ou design, ou uma combinação de palavras, frases, símbolos ou desenhos, que identifica e distingue a fonte dos bens de uma das partes das de outros. Uma marca de serviço é a mesma que uma marca registrada, exceto que ela identifica e distingue a fonte de um serviço em vez de um produto. "Trade Dress" ou "get up" refere-se à aparência da embalagem, que neste contexto pode incluir o layout, cores, imagens e escolhas de design em uma página da web. Ao longo desta Política, o termo "Marca" fere-se tanto a marcas comerciais, marcas de serviço e vestuário.

source: However, the use of a word is "not as a trademark" when it is used functionally as part of the software program, for example, in a file, folder, directory, or path name. Use in this way is not a trademark infringement.
pt_br: No entanto, o uso de uma palavra é "não como uma marca registrada" quando ele é usado funcionalmente como parte do programa de software, por exemplo, em um arquivo, pasta, diretório ou nome de caminho. O uso desta maneira não é uma violação de marca registrada.

source: What is "likelihood of confusion"?
pt_br: O que é "risco de confusão"?

source: There is trademark infringement if your use of a trademark has created a "likelihood of confusion." This means using a trademark in a way that will likely confuse or deceive the relevant consuming public about the source of a product or service using the mark in question. For example, if the "Foo" software extension removes all double spaces after periods, but someone else later creates "Foo" software that adds a third space after periods, consumers would be confused between the two and the newcomer will likely be a trademark infringer. As another example, if a company makes "Foobar" software and a third party offers training called "Foobar Certification," a person is likely to believe, wrongly, that the certification is being offered by the makers of Foobar software. The third party has likely misled consumers about the source of its training and is a trademark infringer.
pt_br: Existe violação de marca registrada se o uso de uma marca registrada criou um "risco de confusão". Isso significa usar uma marca comercial de uma forma que provavelmente irá confundir ou enganar o público consumidor relevante sobre a fonte de um produto ou serviço usando a marca em questão. Por exemplo, se a extensão de software "Foo" remove todos os espaços duplos após os períodos, mas outra pessoa mais tarde cria o software "Foo" que adiciona um terceiro espaço após os períodos, os consumidores ficariam confusos entre os dois eo recém-chegado provavelmente será um infrator de marca registrada . Como outro exemplo, se uma empresa fabrica software "Foobar" e um terceiro oferece treinamento chamado "Certificação Foobar", é provável que uma pessoa acredite, erroneamente, que a certificação está sendo oferecida pelos fabricantes do software Foobar. O terceiro provavelmente induziu os consumidores em erro sobre a fonte de sua formação e é um infrator de marca registrada.

source: What is "nominative" use?
pt_br: O que é uso "nominativo"?

source: So-called "nominative use" (or "nominative fair use"), which is the name of the doctrine under U.S. trademark law, allows the use of another's trademark where it is necessary for understanding. Other countries' trademark laws also have similar provisions. For example, a car repair shop that specializes in a particular brand of automobile, VW for example, must be allowed to say that they repair VW cars. Here is what you should consider when deciding whether your use of a trademark is a nominative fair use:
pt_br: O chamado "uso nominativo" (ou "uso justo nominativo"), que é o nome da doutrina sob a lei de marcas registradas dos Estados Unidos, permite o uso da marca registrada de outra pessoa onde é necessário para a compreensão. As leis de marcas registradas de outros países também têm disposições semelhantes. Por exemplo, uma oficina de reparação de automóveis que se especializa em uma determinada marca de automóvel, VW, por exemplo, deve ser permitido dizer que eles reparam carros VW. Aqui está o que você deve considerar quando decidir se o uso de uma marca é um uso justo nominativo:

source: Whether you can identify the product or service in question without using the trademark
pt_br: Se você pode identificar o produto ou serviço em questão sem usar a marca registrada;

source: Whether you are avoiding a likelihood of confusion in the way that you have used the trademark; and
pt_br: Se você está evitando um risco de confusão na forma como você usou a marca registrada;

source: Whether you have used only as much as is necessary to identify the product or service.
pt_br: Se você usou apenas o máximo necessário para identificar o produto ou serviço.

source: With our "Foobar Certification" example above, the person offering the certification would be allowed to say, under the nominative fair use doctrine, that she is offering "Maude's Certification for Foobar software."
pt_br: Com o nosso exemplo de "Certificação Foobar" acima, a pessoa que oferece a certificação teria permissão para dizer, de acordo com a doutrina de uso justo nominativo, que ela está oferecendo o "Certificado de Maude para o software Foobar".

source: Proper trademark use
pt_br: Uso adequado da marca

source: These rules hold true for all trademarks, not just ours, so you should follow them for our Marks as well as anyone else's.
pt_br: Essas regras são válidas para todas as marcas registradas, não apenas para nós, então você deve segui-las para nossas Marcas, assim como para qualquer outra pessoa.

source: Use of trademarks in text
pt_br: Uso de marcas registradas no texto

source: Always distinguish trademarks from surrounding text with at least initial capital letters or in all capital letters.
pt_br: Sempre distinguir marcas do texto com suas extremidades com letras maiúsculas, pelo menos iniciais ou em letras maiúsculas.

source: Unacceptable: {0}
pt_br: Inaceitável: {0}

source: Acceptable: {0}
pt_br: Aceitável: {0}

source: Always use a trademark as an adjective modifying a noun.
pt_br: Sempre use uma marca registrada como um adjetivo que modifica um substantivo.

source: You can see the nouns we prefer under
pt_br: Você pode ver os substantivos preferidos em

source: "Our trademarks."
pt_br: "Nossas Marcas."

source: Unacceptable: This is a CakePHP. Anyone can install it
pt_br: Inaceitável: Este é um CakePHP. Qualquer pessoa pode instalá-lo

source: Acceptable: This is a CakePHP application. Anyone can install it.
pt_br: Aceitável: Esta é uma aplicação CakePHP. Qualquer um pode instalá-lo.

source: Don't use a trademark as a verb. Trademarks are products or services, never actions.
pt_br: Não use uma marca registrada como um verbo. As marcas registradas são produtos ou serviços, nunca ações.

source: Unacceptable: I CakePHPified my computer today!
pt_br: Inaceitável: Eu CakePHPifiquei meu computador hoje!

source: Acceptable: I installed CakePHP framework on my computer today!
pt_br: Aceitável: Eu instalei a estrutura do CakePHP no meu computador hoje!

source: Don't use a trademark as a possessive. Instead, the following noun should be used in possessive form or the sentence reworded so there is no possessive.
pt_br: Não use uma marca registrada como possessiva. Em vez disso, o substantivo seguinte deve ser usado em forma possessiva ou a sentença reformulada para que não haja possessivo.

source: Unacceptable: CakePHP’s install interface is very clean.
pt_br: Inaceitável: Interface de instalação do CakePHP é muito limpa.

source: Acceptable: The CakePHP install interface is very clean.
pt_br: Aceitável: A interface de instalação do CakePHP está muito limpa.

source: Don't translate a trademark into another language.
pt_br: Não traduza uma marca para outro idioma.

source: Unacceptable: Quiero instalar TartaPHP en mi sistema.
pt_br: Inaceitável: Quiero instalar TartaPHP en mi sistema.

source: Acceptable: Quiero instalar CakePHP en mi sistema.
pt_br: Aceitável: Quiero instalar CakePHP en mi sistema.

source: Use of Logos
pt_br: Uso de Logos

source: You may not change any Logo except to scale it. This means you may not add decorative elements, change the colors, change the proportions, distort it, add elements, or combine it with other logos.
pt_br: Você não pode alterar qualquer Logo a não ser para escalá-lo. Isso significa que você não pode adicionar elementos decorativos, alterar as cores, alterar as proporções, distorcê-lo, adicionar elementos ou combiná-lo com outros logos.

source: However, when the context requires the use of black-and-white graphics and the logo is color, you may reproduce the logo in a manner that produces a black-and-white image.
pt_br: No entanto, quando o contexto exige o uso de gráficos em preto-e-branco e o logo é colorido, você pode reproduzir o logo de uma maneira que produza uma imagem em preto e branco.

source: These guidelines are based on the Model Trademark Guidelines, available at {0}, used under a Creative Commons Attribution 3.0 Unported license: {1}
pt_br: Essas diretrizes são baseadas nas Regras de Marca Registrada modelo, disponível em {0}, Usada sob uma Creative Commons Attribution 3.0 Unported: {1}

source: General Information
pt_br: Informações Gerais

source: Trademark marking and legends
pt_br: Marcação de marcas e legendas

source: The first or most prominent mention of a Mark on a webpage, document, packaging, or documentation should be accompanied by a symbol indicating whether the mark is a registered trademark ("®") or an unregistered trademark ("™"). See our {0} for the correct symbol to use.
pt_br: A primeira menção ou a menção mais proeminente de uma Marca em uma página da Web, documento, embalagem ou documentação deve ser acompanhada por um símbolo indicando se a marca é uma marca registrada ("®") ou uma marca não registrada ("™"). Veja nossa {0} para o símbolo correto para usar.

source: Trademark List
pt_br: lista de Marcas

source: Also, if you are using our Marks in a way described in the sections {0}, please put following notice at the foot of the page where you have used the Mark (or, if in a book, on the credits page), on any packaging or labeling, and on advertising or marketing materials: CakePHP and related Marks are trademarks of Cake Software Foundation, Inc. and Cake Development Corporation, registered in the United States and other countries. Used with permission from Cake Software Foundation, Inc.
pt_br: Além disso, se você estiver usando nossas Marcas da forma descrita nas seções de {0}, por favor coloque o seguinte aviso ao pé da página onde você usou a Marca (ou, na página de créditos), e no seu material de publicidade e marketin: A Cake Software Foundation, Inc. e Cake Development Corporation, registradas nos Estados Unidos e em outros países, são marcas registradas da Cake Software Foundation, Inc. e da Cake Development Corporation. Usado com permissão da Cake Software Foundation, Inc.

source: Uses for which we are granting a license
pt_br: utilizações para as quais liberamos a concessão de uma licença

source: What to do when you see abuse
pt_br: O que fazer quando você ver algum abuso de uso

source: If you are aware of any confusing use or misuse of the Marks in any way, we would appreciate you bringing this to our attention. Please contact us as described below so that we can investigate it further.
pt_br: Se você estiver ciente de qualquer uso confuso ou uso indevido das Marcas de qualquer forma, gostaríamos que você nos atentasse quanto a isso. Entre em contato conosco como descrito abaixo para que possamos investigar mais.

source: Where to get further information
pt_br: Onde obter mais informações

source: If you have any questions about this Policy, would like to speak with us about the use of our Marks in ways not described in the Policy, or see any abuse of our Marks, please contact {0}
pt_br: Se você tiver alguma dúvida sobre esta Política, gostaria de falar com a gente sobre o uso de nossas marcas de maneiras não descritas na Política, ou notar qualquer abuso das nossas marcas, entre em contato: legal [at] cakefoundation.org

source: Trademarks subject to the guidelines
pt_br: Marcas sujeitas às diretrizes

source: Our trademarks
pt_br: Nossas marcas registradas

source: This Policy covers:
pt_br: Esta Política abrange:

source: 1. Our word trademarks and service marks (the "Word Marks"):
pt_br: 1. Nossas marcas comerciais e marcas de serviço (as "Marcas de Palavra"):

source: Mark
pt_br: Marca

source: 2. Our logos (the "Logos"):
pt_br: 2. Nossos logos (os "Logos"):

source: CakePHP Horizontal Logo
pt_br: CakePHP Logo Horizontal

source: CakePHP Vertical Logo
pt_br: CakePHP Logo Vertical

source: CakePHP Vertical Tagline Logo
pt_br: CakePHP Logo Vertical com Slogan

source: CakePHP Horizontal Tagline Logo
pt_br: CakePHP Logo Horizontal com Slogan
