Repository: cakephp/cakephp.org
Catalog: src/Locale/*/default.po
Languages: pt_br

source: The following is a list of recommendations to help keep the CakePHP community strong, active and healthy, as well as a place where everyone feels welcome. These are by no means rules or laws, but instead suggestions and best practices.
pt_br: A seguir você será apresentado a uma lista de recomendações para ajudar a manter a comunidade CakePHP forte, ativa e saudável, bem como um lugar onde todos se sintam bem-vindos. Estes não são de forma alguma regras ou leis, mas sim sugestões e melhores práticas.

source: Remember that when you talk about CakePHP you're representing a global community of people, most of whom are passionate about their involvement, and dedicate their free time and good will to helping the framework. Be friendly and helpful, and always show the respect for others in the same way you'd expect from them.
pt_br: Lembre-se que quando você fala sobre o CakePHP você está representando uma comunidade global de pessoas, a maioria das quais são apaixonadas por seu envolvimento, e dedicam seu tempo livre e boa vontade para ajudar o framework. Seja amistoso e útil, e mostre sempre o respeito com os outros na mesma maneira que você esperaria deles.

source: Never insult, tease or ridicule a user, group of users or community, based on personal opinion or bias towards them. If you don't agree with their opinion or argument, then simply state your reason, provide examples or links, and be polite. If they're acting inappropriately or using abusive language then contact an admin of that channel to have them removed.
pt_br: Nunca insultar, provocar ou ridicularizar um usuário, grupo de usuários ou comunidade, com base em opinião pessoal ou parcialidade em relação a eles. Se você não concordar com a sua opinião ou argumento, basta indicar sua razão, fornecer exemplos ou links, e ser educado. Se eles estão agindo inadequadamente ou usando linguagem abusiva, em seguida, entre em contato com um administrador desse canal para removê-los.

source: Never degrade, belittle, insult or otherwise damage the name or reputation of another project in favour of CakePHP. If you want to compare or promote features of the framework, always aim to do so with relevant and technical arguments, with a positive attitude, and in a humble and respectful manner.
pt_br: Nunca degradar, menosprezar, insultar ou danificar o nome ou a reputação de outro projeto em favor do CakePHP. Se você quiser comparar ou promover características do framework, sempre procure fazê-lo com argumentos relevantes e técnicos, com uma atitude positiva, e de uma maneira humilde e respeitosa.

source: Never use the community channels to announce or advertise a commercial service or product, or to spam other users with content unrelated to CakePHP or the community.
pt_br: Nunca use os canais da comunidade para anunciar um serviço ou produto comercial ou para enviar spam a outros usuários com conteúdo não relacionado ao CakePHP ou à comunidade.

source: When dealing with a user asking for help, if possible, attempt to resolve their problem or concern, no matter how trivial it may seem. We all started from somewhere. If you don't have the time, the patience or the know-how to answer, always refer the user to the CakePHP Community Center at {0}
pt_br: Ao lidar com um usuário pedindo ajuda, se possível, tente resolver seu problema ou preocupação, não importa quão trivial possa parecer. Todos nós partimos de algum lugar. Se você não tiver o tempo, a paciência ou o know-how para responder, direcione o usuário para a página da comunidade em {0}.

source: When talking about a technical feature of CakePHP, always try to make a clear reference to the version of the framework in which it became available. Also, if possible, attempt to supply documentation and examples where possible, to help the reader or listener better understand the concept. And remember, always check your facts before jumping to conclusions or defending a false argument.
pt_br: Ao falar sobre uma característica técnica do CakePHP, tente sempre fazer uma referência clara à versão do framework em que ela se tornou disponível. Além disso, se possível, tente fornecer documentação e exemplos, sempre que possível, para ajudar o leitor ou ouvinte a entender melhor o conceito. E lembre-se, sempre verifique seus fatos antes de tirar conclusões ou defender um argumento falso.

source: When writing example code, always try to apply the CakePHP Conventions and Coding Standards correctly, and check that the example given does not throw an error or give an incorrect result. This promotes good practice, and aids developers in learning to do things "the right way" by default, without hitting too many bumps along the way.
pt_br: Ao escrever código de exemplo, sempre tente aplicar as convenções do CakePHP e padrões de codificação corretamente e verifique se o exemplo fornecido não aciona um erro ou dá um resultado incorreto. Isso promove boas práticas e ajuda os desenvolvedores a aprender a fazer as coisas "no caminho certo" por padrão, sem ter muitas colisões ao longo do caminho.

source: The use of the CakePHP logo and brand assets should follow the instructions available from the logo usage guide: {0}. Following those standards ensures that the visual identity of the framework is never misrepresented or abused.
pt_br: O uso do logo e da marca CakePHP devem seguir as instruções disponíveis a partir do guia de utilização: http://cakephp.org/logos . Seguir essas normas garante que a identidade visual da estrutura nunca será deturpada ou abusada.

source: Try to use the CakePHP name correctly. The name should be spelled "CakePHP", all as one word, with an uppercase "C", and "PHP". This helps keep the links and references to the framework consistent. For example, CAKEPHP, Cakephp, cake-php or just Cake would be incorrect uses. Maintaining a common spelling and format for the name helps keep brand coherent and consistent.
pt_br: Tente usar o nome CakePHP corretamente. O nome deve ser escrito "CakePHP", tudo como uma palavra, com "C" e "PHP" em maiúsculo. Isso ajuda a manter consistentes os links e referências ao framework. Por exemplo, CAKEPHP, Cakephp, cake-php ou apenas Cake seriam usos incorretos. Manter uma ortografia comum e o nome formatado, ajuda a manter a marca coerente e consistente.

source: When making a reference to CakePHP in a marketing or promotional context, it helps to make the name stand-out or interactive. Consider using &lt;strong&gt; or &lt;b&gt; tags for HTML, bold formatting for documents, or making the name a visible link to {0}. Don't overuse the name in any body of text, instead try keeping any direct uses of the name relevant. To even out the usage try to use other references, such as "the framework" or "the project".
pt_br: Ao fazer uma referência ao CakePHP em um contexto de marketing ou promocional, ajude se o nome estiver destacado ou interativo. Considere o uso das tags HTML &lt;strong&gt; ou &lt;b&gt; , formatação em negrito para documentos, ou tornar o nome um link para http://cakephp.org . Não use o nome em excesso em qualquer corpo de texto. Para igualar o uso tente usar outras referências, como "o framework" ou "o projeto".

source: Find Job or Developer
pt_br: Oportunidades

source: If you're looking for skilled CakePHP developers, or are a developer yourself and seeking a freelance project or position at a company, there are many resources available:
pt_br: Se você está procurando por desenvolvedores CakePHP habilidosos, ou for um desenvolvedor e está buscando uma posição em uma empresa ou projeto freelance, há muitas possibilidades de busca:

source: Official career group for CakePHP related opportunities
pt_br: Grupo oficial no Linkedin.

source: Jobs available for freelance developers
pt_br: Vagas de emprego disponíveis para desenvolvedores freelance

source: Contractors who specialize in CakePHP
pt_br: Prestadores de serviços que requisitam profissionais com conhecimento sobre o CakePHP

source: CakePHP related job postings
pt_br: Ofertas de trabalho relacionadas ao CakePHP

source: Where developers and employers connect
pt_br: Onde desenvolvedores e empregadores se conectam.

source: Development and consultancy from the experts
pt_br: Desenvolvimento e consultoria dos especialistas

source: Get Help
pt_br: Obtendo Ajuda

source: Looking for help but don't know where to find it? Here are all the locations you can find community driven support and sources of information:
pt_br: Procurando ajuda, mas não sabe onde encontrá-la? Aqui estão todos os locais onde você pode encontrar suporte e fontes de informações:

source: {0}: Join our CakePHP Slack Channel
pt_br: {0}: Entre no canal #CakePHP no Slack

source: {0}: Join us in the #cakephp IRC channel
pt_br: {0}: Entre no canal #CakePHP no IRC

source: {0}: Report issues, help fix bugs or implement features
pt_br: {0}: Reporte problemas, ajude a corrigir bugs ou implementar recursos

source: {0}: Find news and articles on many topics regarding CakePHP
pt_br: {0}: Encontre notícias e artigos sobre o CakePHP

source: {0}: Get your issues resolved by the open source community
pt_br: {0}: Tenha suas issues resolvidas pela comunidade open-source

source: {0}: Official announcements from the CakePHP community
pt_br: {0}: Anúncios oficiais do CakePHP

source: {0}: Official community channel for the project
pt_br: {0}: Canal oficial do CakePHP no G+

source: {0}: Tutorials and screencasts related to development and events
pt_br: {0}: Tutoriais e screencasts relacionados a desenvolvimento e eventos

source: {0}: Get the latest updates from around the world
pt_br: {0}: Receba as últimas atualizações relacionadas ao CakePHP no Twitter

source: {0}: Official Subreddit of CakePHP
pt_br: {0}: Subreddit oficial do CakePHP

source: CakePHP on Reddit
pt_br: Reddit

source: CakePHP - Build fast, grow solid | Get Involved
pt_br: CakePHP - Build fast, grow solid | Participe

source: Contribute and support the CakePHP Community.
pt_br: Envolva-se e ajude a comunidade de desenvolvedores do CakePHP.

source: Get Involved!
pt_br: Participe!

source: If you're interested in contributing to CakePHP and supporting the community then we'd love for you to join us, there are a variety of ways to get involved and help out.
pt_br: Se você estiver interessado em contribuir com o CakePHP e apoiar a comunidade de desenvolvedores, nós adoraríamos que você se juntasse a nós, existem muitas maneiras de se envolver e ajudar.

source: User Support
pt_br: Suporte ao Usuário

source: One of the greatest ways to contribute to CakePHP is by directly supporting the developer community. There's no need to be a genius or guru to get involved, you may just have the answer to some of the questions being asked. Here are some ways you can get started:
pt_br: Uma das melhores maneiras de contribuir com o CakePHP é apoiar diretamente a comunidade de desenvolvedores. Não precisa ser um gênio ou um guru para se enturmar, talvez você seja o único a ter a resposta a algumas das perguntas que serão feitas. Aqui estão algumas maneiras que você pode começar:

source: Join the {0} and talk to developers who need help. *
pt_br: Junte-se ao {0} e ajude desenvolvedores que precisam de ajuda.

source: #cakephp IRC channel, or Slack group
pt_br: canal #CakePHP no IRC, ou no Slack

source: Answer questions on platforms such as {0}.
pt_br: Responda perguntas em plataformas como o {0}.

source: Comment on posts asking for help with a specific problem.
pt_br: Comente em publicações no fórum para solucionar problemas específicos.

source: * For those who don't have an IRC client we have a web-based client available {0}.
pt_br: * Para aqueles que não têm um cliente de IRC temos um cliente web disponível {0}.

source: here
pt_br: aqui

source: Education and Training
pt_br: Formação e Treinamento

source: Helping others to learn CakePHP is another valuable way to contribute to the community. There are many ways you can help others, these include:
pt_br: Ajudar outras pessoas a aprender sobre o CakePHP é outra maneira valiosa de contribuir para a comunidade. Há muitas maneiras de ajudar, incluindo:

source: Coding Seminars
pt_br: Seminários de programação

source: Live Workshops
pt_br: Workshops ao vivo

source: Training Courses
pt_br: Cursos de aperfeiçoamento

source: Tutorials
pt_br: Tutoriais

source: Additionally, we offer professional training for CakePHP, as well as the opportunity to become an officially certified CakePHP developer through the developer certification program.
pt_br: Além disso, oferecemos treinamento profissional e a oportunidade de tornar-se um desenvolvedor CakePHP oficialmente certificado através do programa de certificação de desenvolvedores.

source: Marketing and Evangelism
pt_br: Marketing e Evangelismo

source: As an open source project, backed by the {0} we don't have a massive budget to market and advertise the framework, so we depend on people like you getting involved and helping support the community. There are many actions which can help raise awareness, share experiences and educate your fellow developers about CakePHP.
pt_br: Como um projeto open-source, apoiado pela {0} não temos um orçamento enorme para divulgar o framework, por isso, dependemos de pessoas, como você, se envolverem e apoiarem a comunidade. Há muitas ações que podem ajudar a aumentar a conscientização, compartilhar experiências e educar os seus colegas desenvolvedores sobre os benefícios do CakePHP.

source: Write and Talk About CakePHP
pt_br: Escreva e Fale Sobre o CakePHP

source: Actively writing and talking about CakePHP helps spread the word about the framework.
pt_br: Falar e escrever sobre o CakePHP ajuda a divulgar o framework.

source: Write an article or blog post about a certain feature or development experience.
pt_br: Escrever um artigo sobre um determinado recurso ou relatar sua experiência quanto a desenvolvimento.

source: Comment on articles or posts and provide ideas and arguments which invite further conversation and feedback.
pt_br: Comentar artigos ou mensagens e fornecer ideias e argumentos que possam gerar interação e feedback.

source: Use social platforms such as {0}, {1} or {2} to provide links to articles, posts, plugins, events, etc.
pt_br: Use as plataformas sociais, como {0}, {1} ou {2} para fornecer links para artigos, posts, plugins, eventos, etc.

source: Help Your Local Community
pt_br: Auxilie sua comunidade local

source: We depend on people who know and understand their local community. This not only refers to the difference in the language, but also the local customs and cultural differences. You can help us by connecting with your local community and supporting CakePHP. A few actions you can undertake include:
pt_br: Dependemos de pessoas que conhecem e compreendem a sua comunidade local. Isso não só se refere à diferença entre idiomas, mas também aos costumes locais e as diferenças culturais. Você pode nos ajudar conectando-se com sua comunidade local e apoiando o CakePHP. Algumas ações que você pode realizar incluem:

source: Starting or joining a local user group
pt_br: Começar ou ingressar em um grupo de usuários local

source: Organizing events or meet-ups
pt_br: Organizar eventos ou meet-ups

source: Distributing information and awareness
pt_br: Compartilhar informação e conhecimento

source: Contributing Code
pt_br: Contribuindo com Código

source: If you want to contribute code for a bug fix then coordinate your approach in the comments of the issue, either by linking to a gist/pastebin or by linking to the commit(s) for the fix.
pt_br: Se você quer contribuir com código para uma correção de bug, então coordene sua abordagem através dos comentários na issue, vinculando a um gist/pastebin ou referenciando o commit(s) da correção.

source: Contributing via a Pull Request
pt_br: Contribuindo através de Pull Requests

source: Contributing via commits on a {0} fork is the preferred way of submitting fixes. If your fix is more than a single commit, you should put the fix on an appropriately named branch. This makes integration of the fix easier.
pt_br: Contribuir através de commits num fork do {0} é a melhor maneira de submeter correções. Se a sua correção é maior do que um único commit, você deve criar um branch nomeado de forma apropriada e relacionada a essa mesma correção. Isso facilita a integração.

source: Testing and Quality Assurance
pt_br: Testes e QA

source: Filing issues is a great way to start contributing to CakePHP. By finding and reporting issues in the code you notify the maintainers of any issues and help get them resolved. Issues for all CakePHP projects are located on {0}
pt_br: Preencher issues é uma forma excelente de ajudar. Ao encontrar e reportar issues, você notifica os desenvolvedores do framework e os ajuda a resolver qualquer tipo de problema. A lista de issues dos projetos relacionados ao CakePHP está armazenada no {0}

source: Found a Bug?
pt_br: Encontrou um Bug?

source: Sometimes there are problems in CakePHP. If you think you've come across one you can:
pt_br: Às vezes há problemas no CakePHP. Se você acha que encontrou um, você pode:

source: Search for a similar or {0}.
pt_br: Buscar uma ocorrência similar ou {0},

source: existing issues
pt_br: issues existentes

source: Create a {0} if you're sure it doesn't already exist OR update the existing issue.
pt_br: Criar uma {0} se você tem certeza de que não existe um problema semelhante.

source: new issue
pt_br: nova issue

source: Add detailed instructions on how to reproduce the bug. This could be in the form of test cases or a code snippet that demonstrates the issue. Not having a way to reproduce an issue, means its less likely to get fixed.
pt_br: Adicione instruções detalhadas sobre como reproduzir o bug. Isso pode ser na forma de casos de teste ou um trecho de código que demonstra o problema. Não ter uma maneira de reproduzir um problema, significa que é menos provável que seja corrigido.

source: Issues That Need Additional Information
pt_br: Issues que precisam de informações adicionais

source: {0} often need to be confirmed or need more information. Asking for additional information on unclear issues doesn't take much time, and helps speed up the process.
pt_br: {0} muitas vezes precisam ser confirmadas ou precisam de mais informações. Pedir informações adicionais sobre issues pouco claras não leva muito tempo e ajuda a acelerar o processo.

source: New issues
pt_br: Novas issues

source: Confirm or Invalidate Existing Issues That Need a Way to Reproduce
pt_br: Confirmar ou invalidar issues existentes que necessitam de alguma forma de reprodução

source: If an issue cannot be easily reproduced, or is unclear, it will be set to hold. Issues on hold generally need a way to be confirmed or require additional information. You can help by finding out ways to reproduce issues, or prodding issue authors for more information. Issues that are on hold can be found {0}
pt_br: Se um problema não puder ser facilmente reproduzido ou não estiver claro, ele será marcado como "on hold". Issues marcadas como on hold, geralmente precisam de uma forma de ser confirmadas. Você pode ajudar descobrindo formas de reproduzir problemas ou incentivar autores de submissões a obter mais informações. Questões que estão on hold podem ser encontradas {0}

source: Bug Issues for Maintenance Releases
pt_br: Problemas de Bugs referentes a releases de manutenção

source: Existing releases usually have a few issues open against them. These issues generally need patches and test cases created for them, so they can be resolved. Preparing patches for open {0} is a great way to get involved with CakePHP, and is one of the first steps to becoming a core contributor.
pt_br: Versões existentes geralmente têm algumas issues abertas relacionadas a elas. Esses problemas geralmente precisam de patches e casos de teste criados para eles. Preparar patches para {0} é uma ótima maneira de se envolver com o CakePHP, e é um dos primeiros passos para se tornar um contribuinte do núcleo de desenvolvimento.

source: unresolved issues
pt_br: issues sem solução

source: Features and Enhancements for Future Releases
pt_br: Recursos e aprimoramentos para lançamentos futuros

source: We are currently working on the {0}. There are still a number of incomplete tasks and {1}. If an issue has been moved into a specific milestone, it is planned for inclusion in that release. Issues are moved into milestones based on community feedback and the core team's plans. If you plan on contributing a feature, please also include relevant test cases for the feature. We want to keep CakePHP as bug free as possible, and test cases have proven to help immensely. If you submit features without test cases, and no documentation it is highly unlikely it will be merged in.
pt_br: Estamos atualmente trabalhando nas versões {0} . Há ainda uma série de tarefas incompletas e {1} . Se um problema tiver sido movido para um milestone específico, está planejado para ser incluído nessa mesma versão indicada. As issues são movidas para milestones com base no feedback da comunidade e nos planos da equipe de desenvolvimento. Se você planeja contribuir com um feature, inclua também casos de teste relevantes. Queremos manter o CakePHP livre de erros, e os casos de teste provaram ser imensamente úteis. Se você enviar features sem casos de teste e nenhuma documentação é altamente improvável que ele seja aceito.

source: 3.x releases
pt_br: versões 3.x

source: unresolved defects
pt_br: defeitos não resolvidos

source: CakePHP is {0}, so you can check the status of the {1} on the Jenkins server at any time.
pt_br: O CakePHP é {0}, então você pode checar o status de várias {1} no servidor Jenkins a qualquer momento.

source: Documentation is another excellent way to start getting involved with CakePHP. We have two primary forms of documentation, the {0} and the {1}. The API is generated from the source code, so if you find an inaccuracy or issue with the API documentation, you can file a patch against the {2}. The Cookbook is a community managed documentation source which can also be found on {3}. Guidelines on contributing to the documentation can be reviewed {4}.
pt_br: Documentação é outra excelente maneira de começar a se envolver com o CakePHP. Temos duas formas primárias de documentação, a {0} e o {1}. A API é gerada a partir do código-fonte, então se você encontrar uma imprecisão ou problema com a documentação da API, você deve enviar um patch relacionado ao {2}. O Cookbook é uma fonte de documentação gerenciada pela comunidade que também pode ser encontrada no {3}. Orientações sobre contribuições para a documentação podem ser vistas {4}.

source: source code
pt_br: código-fonte

source: Translations
pt_br: Traduções

source: We have developers from countries all over the world who use CakePHP. If you're a non-english speaker, translating the the {0} content into your language is another way to help support the community. Providing the official documentation and support material in as many languages as possible helps lower the barrier to entry to using the framework.
pt_br: Temos desenvolvedores de muitos países que usam o CakePHP. Traduzir o conteúdo do {0} para a sua língua é outra maneira de apoiar a comunidade. Fornecer o material de suporte e documentação oficial em muitos idiomas, torna possível diminuir a barreira de entrada que impede novos desenvolvedores de utilizarem o framework.

source: Get Involved
pt_br: Participe

source: Translation
pt_br: Tradução

source: New CakePHP {0} Red Velvet.
pt_br: Novo CakePHP {0} Red Velvet.

source: Faster. Stronger. Tastier.
pt_br: Rápido. Robusto. Apetitoso.
