Repository: cakephp/cakephp.org
Catalog: src/Locale/*/default.po
Languages: pt_br

source: CakePHP Version Number <br> Horizontal Logo
pt_br: CakePHP Logo Horizontal <br> Número da Versão

source: CakePHP Version Number<br>Vertical Logo
pt_br: CakePHP Logo Vertical <br> Número da Versão

source: CakePHP Version Number<br>and Name Horizontal Logo
pt_br: CakePHP Logo Horizontal <br> Número da Versão e Nome

source: CakePHP Version Number<br>and Name Vertical Logo
pt_br: CakePHP Logo Vertical <br> Número da Versão e Nome

source: 3. CakePHP sister brands’ logos:
pt_br: 3. Logos das marcas irmãs do CakePHP:

source: CakeDC Full Name Horizontal Signature
pt_br: CakeDC Nome Completo Assinatura Horizontal

source: CakeDC Initials Horizontal Signature
pt_br: CakeDC Iniciais Assinatura Horizontal

source: CakeDC Full Name Vertical Signature
pt_br: CakeDC Nome Completo Assinatura Vertical

source: CakeDC Initials Vertical Signature
pt_br: CakeDC Iniciais Assinatura Vertical

source: CakeSF Full Name Horizontal Signature
pt_br: CakeSF Nome Completo Assinatura Horizontal

source: CakeSF Initials Horizontal Signature
pt_br: CakeSF Iniciais Assinatura Horizontal

source: CakeSF Full Name Vertical Signature
pt_br: CakeSF Nome Completo Assinatura Vertical

source: CakeSF Initials Vertical Signature
pt_br: CakeSF Iniciais Assinatura Vertical

source: CakeFest Horizontal Signature
pt_br: CakeFest Assinatura Horizontal

source: CakeFest Vertical Signature
pt_br: CakeFest Assinatura Vertical

source: CakeTalent Horizontal Signature
pt_br: CakeTalent Assinatura Horizontal

source: CakeTalent Vertical Signature
pt_br: CakeTalent Assinatura Vertical

source: CakeJobs Horizontal Signature
pt_br: CakeJobs Assinatura Horizontal

source: CakeJobs Vertical Signature
pt_br: CakeJobs Assinatura Vertical

source: CakeUniversity Horizontal Signature
pt_br: CakeUniversity Assinatura Horizontal

source: CakeUniversity Vertical Signature
pt_br: CakeUniversity Assinatura Vertical

source: 4. Community Flags
pt_br: 4. Flags comunitárias

source: These have been corrected to show your support for the CakePHP project. The terms of this Policy applies to the usage of these logos.
pt_br: Estas flags foram designadas para mostrar seu apoio ao projeto CakePHP. Os termos desta Política aplicam-se à utilização destes logos.

source: 5. Community Flags usage Guidelines:
pt_br: 5. Diretrizes de Uso das Flags Comunitárias:

source: Respect a margin over a forth of the flag’s hight to ensure visual effectiveness. The side margins might be disregarded while using the flag on the extreme left or right sides of a layout.
pt_br: Respeite uma margem maior que 1/4 da altura da bandeira para garantir a eficácia visual. As margens laterais podem ser desconsideradas ao usar a bandeira no lado esquerdo ou direito de um layout.

source: 5.2. Brand stylistic shape: the ellipse used to design the Brandmark is also a brand asset itself, and it can be used as a decorative corner on layout boxes and backgrounds.
pt_br: 5.2. Forma estilística da marca: a elipse usada para projetar o Brandmark é também um ativo da marca em si, e pode ser usada como um canto decorativo em caixas e fundos de layout.

source: 5.3. Iconography: icons and illustrations follow the Brandmark aesthetics: flat, clean and use negative space for lighting and shading. The images are designed using the official color palette. Conceptually, the ico nography follows the baking universe.
pt_br: 5.3. Iconografia: ícones e ilustrações seguem a estética da Brandmark: plana, limpa e usa espaço negativo para iluminação e sombreamento. As imagens são projetadas usando a paleta de cores oficial. Conceitualmente, a iconografia segue a referência de "cozinhar um bolo".

source: This Policy encompasses all trademarks and service marks, whether Word Marks, Logos or Trade Dress, which are collectively referred to as the “Marks.” Some Marks may not be registered, but registration does not equal ownership of trademarks. This Policy covers our Marks whether they are registered or not.
pt_br: Esta Política abrange todas as marcas registradas e marcas de serviço, sejam Marcas de Palavras, Logos ou Trade Dress, que são coletivamente referidas como "Marcas". Algumas Marcas não podem ser registradas, mas o registro não é igual a propriedade de marcas registradas. Esta Política abrange as nossas Marcas, quer estejam registadas ou não.

source: The trademarks we are licensing in this Policy
pt_br: As marcas comerciais que estamos licenciando nesta Política

source: The following trademarks are ones that covered by the Policy, all others are reserved exclusively to our use:
pt_br: As seguintes marcas registradas são aquelas cobertas pela Política, todas as outras são reservadas exclusivamente ao nosso uso:

source: Community flags as shown in Section 4
pt_br: Como indicado na seção 4

source: Contact us as described in "{0}" below if you have questions or want to ask permission to use any of our reserved trademarks.
pt_br: Contacte-nos conforme descrito em "{0}" abaixo se você tiver dúvidas ou quiser pedir permissão para utilizar qualquer uma das nossas marcas reservadas.

source: Introduction
pt_br: Introdução

source: This document, the "Policy," outlines the CakePHP project's (the "Project") policy for the use of our trademarks. While our software is available under a free and open source software license, the copyright license does not include an implied right or license to use our trademark.
pt_br: Este documento, que será referenciado como "Política", descreve a política do projeto CakePHP (o "Projeto") para o uso de nossas marcas registradas. Enquanto o nosso software está disponível sob uma licença de software livre e de código aberto, a licença de direitos autorais não inclui um direito implícito ou licença para usar nossa marca registrada.

source: The role of trademarks is to provide assurance about the quality of the products or services with which the trademark is associated, but because an open source license allows your unrestricted modification of the copyrighted software, we cannot be sure that your modifications to the software are ones that will not be misleading if distributed under the same name. Instead, this Policy describes the circumstances under which you may use our trademarks.
pt_br: O papel das marcas é fornecer garantia sobre a qualidade dos produtos ou serviços com os quais a marca está associada, mas porque uma licença de código aberto permite a sua modificação irrestrita do software protegido por direitos autorais, não podemos ter certeza de que suas modificações no software não serão enganosas se distribuído com o mesmo nome. Em vez disso, esta Política descreve as circunstâncias em que você pode usar nossas marcas registradas.

source: In this Policy we are not trying to limit the lawful use of our trademarks, but rather describe for you what we consider the parameters of lawful use to be. Trademark law can be ambiguous, so we hope to provide enough clarity for you to understand whether we will consider your use licensed or non-infringing.
pt_br: Nessa Política não estamos tentando limitar o uso legal de nossas marcas registradas, mas descrevemos para você o que consideramos os parâmetros de uso legítimo. Direito de marca pode ser ambíguo, por isso esperamos fornecer suficiente clareza para você entender se vamos considerar o seu uso licenciado ou não-infrator.

source: The sections that follow describe what trademarks are covered by these Guidelines, as well as uses of the trademarks that are allowed without additional permission from us. If you want to use our trademarks in ways that are not described in this Policy, please see "{0}" below for contact information. Any use that does not comply with this Policy or for which we have not separately provided written permission is not a use that we have approved, so you must decide for yourself whether the use is nevertheless lawful.
pt_br: As seções a seguir descrevem quais marcas são cobertas nesta Política, bem como os usos das marcas registradas que são permitidos sem permissão adicional de nossa parte. Se você quiser usar nossas marcas comerciais de maneiras que não são descritas nesta Política, consulte "{0} " abaixo para obter informações de contato. Qualquer utilização que não cumpra esta Política ou para a qual não tenha fornecido separadamente permissão por escrito não é um uso que aprovamos, pelo que deve decidir por si mesmo se o uso é, no entanto, lícito.

source: Universal considerations for all uses
pt_br: Considerações universais para todos os usos

source: Contents
pt_br: Conteúdo

source: Whenever you use one of the Marks, you must always do so in a way that does not mislead anyone, either directly or by omission, about exactly what they are getting and from whom. The law reflects this requirement in two major ways described in more detail {0}: it prohibits creating a {1} but allows for {2}. For example, you cannot say you are distributing the CakePHP Framework when you're distributing a modified version of it, because people would be confused because they are not getting the same features and functionality they would get if they downloaded the software directly from us. You also cannot use our logo on your website in a way that suggests that your website is an official website or that we endorse your website. You can, though, say you like the CakePHP Framework, that you participate in the CakePHP community, that you are providing an unmodified version of the CakePHP Framework, or that you wrote a book describing how to use the CakePHP Framework.
pt_br: Sempre que você usar uma das Marcas, você deve sempre fazê-lo de uma maneira que não engane ninguém, diretamente ou por omissão, sobre exatamente o que eles estão recebendo e de quem. A lei reflete esta exigência de duas maneiras principais descritas em mais detalhes {0}: que proíbe a criação de um {1} permite a {2} . Por exemplo, você não pode dizer que está distribuindo o Framework CakePHP quando distribui uma versão modificada dele, porque as pessoas ficariam confusas por não estarem recebendo os mesmos recursos e funcionalidades que obteriam se baixassem o software diretamente de nós. Você também não pode usar nosso logo em seu site de uma forma que sugere que seu site é um site oficial ou que endossamos seu site. Você pode, no entanto, dizer que gosta do Framework CakePHP, que participa da comunidade CakePHP, que está fornecendo uma versão não modificada do Framework CakePHP ou que escreveu um livro descrevendo como usar o Framework CakePHP.

source: below
pt_br: abaixo

source: "likelihood of confusion"
pt_br: "risco de confusão"

source: "nominative use"
pt_br: "utilização nominativa"

source: This fundamental requirement, that it is always clear to people what they are getting and from whom, is reflected throughout this Policy. It should also serve as your guide if you are not sure about how you are using the Marks.
pt_br: Esta exigência fundamental, para que seja smpre claro para as pessoas o que eles estão recebendo e de quem, é refletida ao longo desta Política. Ele também deve servir como seu guia se você não tem certeza sobre como você está usando as Marcas.

source: In addition:
pt_br: Em adição:

source: You may not use the Marks in association with the use or distribution of software if you are also not in compliance with the copyright license for the software.
pt_br: Você não pode usar as Marcas em associação com o uso ou distribuição de software se você também não estiver em conformidade com a licença de direitos autorais do software.

source: You may not use or register, in whole or in part, the Marks as part of your own trademark, service mark, domain name, company name, trade name, product name or service name.
pt_br: Você não pode usar ou registrar, no todo ou em parte, as Marcas como parte de sua própria marca registrada, marca de serviço, nome de domínio, nome da empresa, nome comercial, nome do produto ou nome do serviço.

source: Trademark law does not allow your use of names or trademarks that are too similar to ours. You therefore may not use an obvious variation of any of our Marks or any phonetic equivalent, foreign language equivalent, takeoff, or abbreviation for a similar or compatible product or service. We would consider the following too similar to one of our Marks:
pt_br: A lei de marcas registradas não permite o uso de nomes ou marcas que sejam muito semelhantes às nossas. Portanto, você não pode usar uma variação óbvia de nenhuma de nossas Marcas ou qualquer equivalente fonético, equivalente em idioma estrangeiro, decolagem ou abreviação de um produto ou serviço similar ou compatível. Consideraríamos o seguinte muito semelhante a uma de nossas Marcas:

source: Any mark ending with the letters Cake.
pt_br: Qualquer marca terminando com as letras Cake.

source: Any mark beginning with the letters Cake.
pt_br: Qualquer marca começando com as letras Cake.

source: You agree that you will not acquire any rights in the Marks and that any goodwill generated by your use of the Marks inures solely to our benefit.
pt_br: Você concorda que não adquirirá quaisquer direitos sobre as Marcas e que qualquer ágio gerado pelo seu uso das Marcas será exclusivamente para nosso benefício.

source: Proposed article titles
pt_br: Títulos de artigos propostos

source: Writing sample
pt_br: Exemplo de escrita

source: Extra information
pt_br: Informações complementares

source: Sorry, There’s no Cake Here...
pt_br: POXA! Não tem bolo aqui...

source: Unfortunately the page you were looking for could not be found. It may be temporarily unavailable, moved or no longer exist. Check the URL you entered for any mistakes and try again. Alternatively, you could take a look around the rest of our site.
pt_br: Infelizmente a página que você estava procurando não pôde ser encontrada. Pode estar temporariamente indisponível, movida ou não existir mais. Verifique a URL que você digitou devido a eventuais erros e tente novamente. Alternativamente, você poderia dar uma olhada no resto do nosso site.

source: ERROR!
pt_br: ERRO!

source: An Internal Error Has Occurred.
pt_br: Ocorreu um erro interno.

source: CakePHP - Build fast, grow solid | Business Solutions
pt_br: CakePHP - Build fast, grow solid | Ofertas Comerciais

source: CakePHP Business solutions by CakeDC, the commercial entity behind the framework.
pt_br: Soluções comerciais ofertadas pela CakeDC, a entidade comercial por trás do framework.

source: Community Center
pt_br: Centro da Comunidade

source: CakePHP is an open-source web, rapid development framework that makes building web applications simpler, faster and require less code. It follows the model–view–controller (MVC) . Manual for beginners now available and links towards the last version.
pt_br: CakePHP é um projeto open-source para web, framework de desenvolvimento rápido que simplifica e agiliza o desenvolvimento de aplicações web. Segue o padrão MVC.

source: CakePHP - Build fast, grow solid | CakePHP latest news
pt_br: CakePHP - Build fast, grow solid | Últimas Notícias do CakePHP

source: Latest CakePHP News.
pt_br: Últimas notícias do CakePHP.

source: Newsletter Archive
pt_br: Arquivo de Newsletters

source: CakePHP - Build fast, grow solid | Newsletter Sign Up
pt_br: CakePHP - Build fast, grow solid | Assinatura de Newsletter

source: Newsletter Sign Up Form
pt_br: Formulário de Inscrição das Newsletters

source: Subscribe to our Newsletters
pt_br: Assine nossas newsletters

source: are required fields
pt_br: são campos obrigatórios

source: Email Address
pt_br: Endereço de Email

source: Past Newsletters
pt_br: Newsletters antigas

source: CakePHP - Build fast, grow solid | Privacy policy
pt_br: CakePHP - Build fast, grow solid | Política de privacidade

source: CakePHP Privacy Policy.
pt_br: CakePHP Política de Privacidade.

source: Privacy Policy
pt_br: Política de Privacidade

source: The privacy of our visitors to cakephp.org is important to us.
pt_br: A privacidade dos nossos visitantes é importante para nós.

source: At cakephp.org, we recognize that privacy of your personal information is important.
pt_br: Reconhecemos que a privacidade de suas informações pessoais é importante.

source: Here is information on what types of personal information we receive and collect when you use and visit cakephp.org, and how we safeguard your information.
pt_br: Aqui há informações sobre quais tipos de dados recebemos e coletamos enquanto você navegar pelo site cakephp.org, e como guardamos essa informação.

source: We never sell your personal information to third parties.
pt_br: Nós nunca vendemos suas informações pessoais a terceiros.

source: Log Files:
pt_br: Arquivos de registro:

source: As with most other websites, we collect and use the data contained in log files.
pt_br: Como com a maioria dos outros sites, podemos coletar e utilizar os dados contidos nos arquivos de log.

source: The information in the log files include your IP (internet protocol) address, your ISP (internet service provider, such as AOL or Shaw Cable), the browser you used to visit our site (such as Internet Explorer or Firefox), the time you visited our site and which pages you visited throughout our site.
pt_br: As informações nos arquivos de log contem o seu endereço IP (internet protocol), o seu ISP (internet service provider, tais como Oi ou NET), o navegador que você usou para visitar o nosso site (como o Internet Explorer ou o Firefox), o tempo que você visitou nosso site e quais páginas você visitou em todo nosso site.

source: We do use cookies to store information, such as your personal preferences when you visit our site.
pt_br: Nós usamos cookies para armazenar informações, tais como suas preferências pessoais quando visita o nosso site.

source: Advertising:
pt_br: Publicidade:

source: We use third-party advertising companies to serve ads when you visit our website.
pt_br: Usamos empresas de publicidade de terceiros para veicular anúncios quando você visita nosso website.

source: These companies may use information (not including your name, address, email address, or telephone number) about your visits to this and other websites in order to provide advertisements about goods and services of interest to you.
pt_br: Essas empresas podem usar informações (não incluindo seu nome, endereço, endereço de e-mail ou número de telefone) sobre suas visitas a este e a outros websites a fim de fornecer anúncios sobre bens e serviços interessantes para você.

source: If you would like more information about this practice and to know your choices about not having this information used by these companies, %s.
pt_br: Se você gostaria de obter mais informações sobre esta prática e conhecer as suas escolhas para não ter essas informações usadas por essas empresas, %s.

source: click here
pt_br: clique aqui

source: CakePHP - Build fast, grow solid | The Brand
pt_br: CakePHP - Build fast, grow solid | A Marca

source: CakePHP's evolution through the years explained
pt_br: A evolução da marca do CakePHP através dos anos

source: vision
pt_br: visão

source: CakePHP - Build fast, grow solid | Core Team Profiles
pt_br: CakePHP - Build fast, grow solid | Perfis dos Bakers

source: Meet the CakePHP Core development team
pt_br: Conheça o time de desenvolvimento do CakePHP

source: The
pt_br: Os

source: Meet the team behind CakePHP
pt_br: Conheça o time por trás do CakePHP

source: read more
pt_br: leia mais

source: CakePHP - Build fast, grow solid | Logos and Trademarks
pt_br: CakePHP - Build fast, grow solid | Logos e Marcas Registradas

source: CakePHP Logos and Trademark policies.
pt_br: Políticas de uso de logos e marcas registradas.

source: CakePHP Trademark and Logo Policy
pt_br: Política de Uso da Marca CakePHP

source: CakePHP - Build fast, grow solid | Learn CakePHP from the experts | Video Training
pt_br: CakePHP - Build fast, grow solid | Aprenda CakePHP com os experts | Treinamento por vídeo

source: Checkout our videos from youtube channel.
pt_br: Acompanhe nossos vídeos do canal no Youtube.

source: Load More
pt_br: Carregar Mais

source: Enter a new password
pt_br: Indique uma nova senha

source: New password
pt_br: Nova senha

source: Confirm new password
pt_br: Confirmar nova senha

source: Request a new password
pt_br: Solicitar uma nova senha

source: Username or email
pt_br: Nome de usuário ou email

source: CakePHP - Build fast, grow solid | PHP Framework | Become a Tech Writer
pt_br: CakePHP - Build fast, grow solid | Seja Autor Remunerado

source: CakePHP is always on the look-out for basic/simple tutorials, from set-up all the way to more advanced topics - all with the goal to make CakePHP more accessible!
pt_br: O CakePHP está sempre a procura de tutoriais técnicos, sejam sobre assuntos simples ou abordagens de tópicos avançados, com o objetivo de tornar o CakePHP mais acessível.

source: CakePHP, CakePHP Framework, CakePHP Tech writer
pt_br: CakePHP, CakePHP Framework, CakePHP Autor, Tutoriais, Pago, Remunerado, PHP

source: GET PAID TO WRITE ABOUT CAKEPHP
pt_br: SEJA PAGO PARA ESCREVER SOBRE O CAKEPHP

source: In-depth tutorials, simple tutorials and more.
pt_br: Tutoriais complexos, simples e muito mais.

source: Sponsored by:
pt_br: Patrocinado por:

source: CakePHP wants to publish <br />your tech tutorial!
pt_br: O CakePHP quer publicar<br>seu tutorial técnico!

source: Are you a keen CakePHP community member and have an insatiable talent for explaining concepts, constructs and the intricacies of the CakePHP framework?
pt_br: Você é um membro ativo da Comunidade CakePHP e tem um talento insaciável para explicar conceitos, práticas e segredos do framework CakePHP?

source: Our community is always on the look-out for basic/simple tutorials, from set-up all the way to more advanced topics - all with the goal to make CakePHP more accessible!
pt_br: Nossos membros da comunidade de desenvolvedores estão sempre a procura de tutoriais técnicos, sejam sobre assuntos simples ou abordagens de tópicos avançados, com o objetivo de tornar o CakePHP mais acessível ao público.

source: Are you perhaps a tad intrigued? - you don’t need to be a technical writer, you just need to know your CakePHP stuff -and, of course, be able to explain it! We will work with you on the final editing and article completion.
pt_br: Talvez você tenha algumas dúvidas, mas vamos lá, você não precisa ser um escritor técnico, você só precisa ter um bom nível de conhecimento sobre o CakePHP e, claro, ser capaz de explicá-lo! Nós trabalharemos com você até a conclusão das edições.

source: And on top of becoming known as one of our tutorial writers within the CakePHP Community - as a bonus, CakeDC is sponsoring you to write! <strong>Earn up to $50 per article!</strong>
pt_br: Tornar-se conhecido como um dos nossos autores na comunidade CakePHP e como um bônus, a CakeDC está patrocinando essa iniciativa! <strong>Ganhe até $50 por artigo!</strong>

source: Make
pt_br: Ganhe

source: up to
pt_br: até

source: Unsure if you fit the bill?<br>We are looking for the following:
pt_br: Não tem certeza se você se encaixa no perfil?<br>Estamos procurando o seguinte:

source: Technical<br>expertise and<br>best practices
pt_br: Conhecimento<br>técnico e<br>boas práticas

source: Correct and<br>comprehensive<br>commands
pt_br: Comandos<br>corretos e<br>compreensivos

source: Clear and concise<br>explanations
pt_br: Explicações claras<br>e concisas

source: Friendly and<br>informative<br>writing style
pt_br: Estilo de escrita<br>amigável e<br>informativo

source: Author Details
pt_br: Sobre o Autor

source: (Required)
pt_br: (Obrigatório)

source: MyCakePHP Community username
pt_br: Nome de usuário do MyCakePHP

source: (Optional)
pt_br: (Opcional)

source: Submit a writing sample to see if you qualify!
pt_br: Envie uma amostra para ver se você se qualifica!
