Repository: cakephp/cakephp.org
Catalog: src/Locale/*/default.po
Languages: pt_br

source: Please submit 1-3 proposed article titles of topics that you would be comfortable covering and are interested in writing about. Topics should be related to CakePHP, and fall within the framework specific elements (such as Cake Bake).
pt_br: Por favor envie de 1-3 títulos de artigo propostos dos tópicos que você estaria confortável a cobrir e está interessado em escrever sobre. Tópicos devem ser relacionados ao CakePHP e estar dentro os elementos específicos do framework (como o bake via cmd).

source: Only original content can be considered, Unfortunately content already posted elsewhere cannot be used.
pt_br: Somente conteúdo original pode ser considerado, infelizmente o conteúdo já postado em outro lugar não pode ser usado.

source: This is where you share your writing sample with us - a short introduction as well as the first two steps to your tutorial. At this time, we are only accepting English tutorials.
pt_br: Aqui é onde você pode compartilhar sua amostra de escrita com a gente - uma breve introdução, bem como os dois primeiros passos para o seu tutorial. Neste momento, só aceitamos tutoriais em inglês.

source: Do you have your own blog? Let us know! - also, share with us your GIthub, StackOverflow or Twitter handles, we would love to get to know you better before assessing your application!
pt_br: Você tem seu próprio blog? Conte para a gente! Além disso, compartilhe conosco suas contas no GIthub, StackOverflow ou Twitter, gostaríamos muito de te conhecer melhor antes de avaliar sua submissão!

source: Submit!
pt_br: Enviar!

source: Thanks for sending us so many writing samples!
pt_br: Obrigado por nos enviar seus exemplos!

source: This form has been temporarily disabled while we review the backlog of submissions. <br>Please check back soon!
pt_br: Este formulário foi temporariamente desativado enquanto revemos o backlog de submissões.<br>Por favor, volte em breve!

source: Notify me!
pt_br: Notifique-me!

source: Get paid with PayPal
pt_br: Seja pago com o PayPal

source: IN-DEPTH<br>TUTORIALS
pt_br: TUTORIAIS<br>APROFUNDADOS

source: 1,500+ Words
pt_br: 1.500 ou + palavras

source: SIMPLE<br>TUTORIALS
pt_br: TUTORIAIS<br>SIMPLES

source: 800+ Words
pt_br: 800 ou + palavras

source: Most tutorials are paid out at $50. Short tutorials with only a few commands or a few paragraphs of explanation are paid out at $25.
pt_br: A maioria dos tutoriais são pagos a US $50. Pequenos tutoriais com apenas alguns comandos ou alguns parágrafos de explicação são pagos a US $25.

source: {0} to {1}
pt_br: {0} a {1}

source: “We got a high ROI from converting our custom PHP app to CakePHP. We love the continually expanding suite of utilities, plugins, and development patterns at our disposal!”
pt_br: "Tivemos um alto ROI na conversão do nosso aplicativo em PHP personalizado para o CakePHP. Nós adoramos todos os recursos que o framework tem a oferecer, plugins e padrões de desenvolvimento sempre à nossa disposição."

source: “CakePHP was the most efficient way we could find to rapidly develop our intricate system. We needed a platform that could handle our high volume of users without issues and CakePHP has certainly delivered.”
pt_br: "O CakePHP foi a maneira mais eficiente que encontramos para desenvolver rapidamente nosso sistema. Precisávamos de uma plataforma que pudesse lidar com o nosso alto volume de usuários sem problemas e o CakePHP certamente cumpriu sua função."

source: “From the simplest micro kiosk app to my highly complex gallery management app, CakePHP is the framework of choice. It allows modular development that makes sense, and it's architecturally solid and performant. Whatever you are building, CakePHP can help you get it done.”
pt_br: "Do micro app mais simples até meu aplicativo de gestão altamente complexo de galerias, o CakePHP é o framework a ser escolhido. Permite desenvolvimento modular que faz sentido, e arquitetonicamente é sólido e entrega alto desempenho. Tudo o que você está construindo, o CakePHP pode ajudá-lo a realizar."

source: “Having inherited this CakePHP project, I didn’t chose CakePHP so much as choose to continue using it. After seeing the power and functionality of the framework in use, it wasn’t a difficult choice to make.”
pt_br: "Tendo herdado um projeto em CakePHP, não escolhi o CakePHP, mas apesar disso optei por continuar a usá-lo. Depois de ver o poder e as funcionalidades do framework na prátcia, não foi uma escolha difícil de se fazer."

source: Youtube Channel
pt_br: Youtube

source: Featured Resources
pt_br: Recursos em destaque

source: Certification
pt_br: Certificação

source: Forum
pt_br: Fórum

source: Paid Support
pt_br: Suporte Pago

source: Logos & Trademarks
pt_br: Logos & Marcas Registradas

source: Larry Masters the Co-Founder of the CakePHP project, first released in May 2005, and has contributed as a lead developer and advisor ever since. He has been involved in Open Source development for many years, dating back to his first contributions made to The Exchange Project, now called osCommerce. Prior to developing the CakePHP framework and starting Cake Software Foundation, Inc. he was a core developer of PostNuke, now continued as Zikula. He has 30 plus years experience in software development, system administration, and database design. His passion for excellence is shown in the code he writes and time dedicated to the CakePHP framework development over the past 11 years.
pt_br: Larry Masters é o co-fundador do projeto CakePHP, lançado em maio de 2005, contribuiu como desenvolvedor líder e consultor desde então. Tem estado envolvido com iniciativas open-source a muitos anos. Voltando às suas primeiras contribuições feitas para o The Exchange Project, agora conhecido como osCommerce. Antes de desenvolver o framework CakePHP e começar a Cake Software Foundation, Inc, era um membro do PostNuke, agora conhecido como Zikula. Tem 30 anos de experiência no desenvolvimento de software, administração de sistemas e design de banco de dados. Sua paixão pela excelência é evidente no código que escreve e no tempo dedicado ao desenvolvimento do framework CakePHP nos últimos 11 anos.

source: Co-Founder
pt_br: Co-Fundador

source: Mark is a core member of the CakePHP team, serving as a lead developer since late 2009. He is also a developer at FreshBooks. CakePHP Developer, Dad, MtG nerd, and moonlight Illustrator.
pt_br: Mark é um membro do núcleo de desenvolvimento do CakePHP, operando como desenvolvedor líder desde 2009. Também é desenvolvedor na FreshBooks, pai, apaixonado por Magic e ilustrador nas horas vagas.

source: Lead Developer
pt_br: Desenvolvedor Líder

source: José is a full-stack software developer that loves to solve difficult problems. He has been contributing to the CakePHP framework since 2009, and he often does talks about its amazing ORM. In his spare time, he teaches and practices mindfulness, ride his bike, or learns new programming languages.
pt_br: José é um desenvolvedor de software full-stack que ama resolver problemas complexos. Tem contribuído com o framework CakePHP desde 2009 e frequentemente realiza palestras sobre seu ORM incrível. No seu tempo livre ensina e pratica meditação, anda de bicicleta ou aprende novas linguagens de programação.

source: ORM Developer
pt_br: Desenvovedor do ORM

source: A developer based in New York, New York with an extremely active github account and an interest in Docker and Server Monitoring. He's been doing this since around 2008 and sometimes he blogs.
pt_br: Um desenvolvedor situado em Nova Iorque, extremamente ativo no GitHub e interessado em monitoramento de servidores e no Docker. Engajado desde 2008, de vez em quando ele posta em seu blog.

source: Core Member
pt_br: Núcleo de desenvolvimento

source: A programmer by day and night, you will generally find him lurking in the deepest darkest corners of the internet. He's also involved in maintaining lot of popular CakePHP community plugins.
pt_br: Um programador de dia e de noite, você geralmente vai encontrá-lo espreitando nos cantos mais profundos e escuros da internet. Ele também está envolvido na manutenção de muitos plugins populares da comunidade CakePHP.

source: Bryan Crowe is an open source developer living in New York, NY. He is involved in the CakePHP framework.
pt_br: Bryan Crowe é um desenvolvedor entusiasta do open-source, vivendo em Nova Iorque.

source: A software developer by profession and not just because it’s a job. Florian is a core CakePHP team developer as well as having worked with CakeDC itself, doing CakePHP development since 2007. Florian sees programming as a true profession and not just a job for him, he likes to work on open source projects after work hours and has an interest in Unity3D and c# as well. He’s working as lead developer for PSA Publishers Ltd
pt_br: Um desenvolvedor de software por profissão e não apenas porque é um trabalho. Florian tanto faz parte do time do CakePHP, bem como trabalhou com a CakeDC em si, desenvolvendo com e para o CakePHP desde 2007. Florian vê a programação como uma verdadeira profissão e não apenas um emprego, ele gosta de trabalhar em projetos open-source e tem interesse em Unity3D e C# também. Ele está trabalhando como desenvolvedor líder para a PSA Publishers Ltd.

source: Mark has been a web-software enthusiast and Open Source Contributor for many years. He is a German Software Developer living in Berlin who started to use CakePHP in the 1.2 days. As one of the core developers of CakePHP he is a huge fan of rapid development - and has been using CakePHP a lot for this in his applications so far. On his blog dereuromark.de he sometimes blogs about web and CakePHP related topics.
pt_br: Mark tem sido um entusiasta de software para web e contribuinte open-source por muitos anos. Ele é um desenvolvedor de software alemão morando em Berlim, que começou a usar o CakePHP nos tempos de 1.2. Como um dos principais desenvolvedores do CakePHP, ele é um grande fã de desenvolvimento rápido e tem sido muito feliz usando o CakePHP em suas aplicações até agora. Em seu blog dereuromark.de ele as vezes escreve sobre tópicos relacionados à web e ao CakePHP.

source: CTO at @bownty, @CakePHP core developer, tech advisor at @getlinkfire - lover of technology and servers - author of FriendsOfCake/crud
pt_br: CTO na @bownty, membro do núcleo de desenvolvimento do @CakePHP, consultor de tecnologia da @getlinkfire - amante de tecnologia e servidores - autor do FriendsOfCake/crud

source: Walther is a software engineer/developer primarily working in PHP (Using CakePHP as his framework of choice). Also a core member of the team, as well as the Croogo and Friends of Cake development team. When he is not developing or behind his PC screen, you can find him either spending time with his family, or at Scouts, where he is an adult leader/Scouter.
pt_br: Walther é um engenheiro/desenvolvedor de software trabalhando principalmente com PHP (utilizando CakePHP como seu framework preferido). Também é um membro do núcleo de desenvolvimento, bem como da equipe de desenvolvimento do Croogo e do grupo Friends of Cake. Quando ele não está se desenvolvendo ou atrás da tela do seu PC, você pode encontrá-lo passando um tempo com sua família, ou como líder de escoteiros.

source: An architect and engineer that loves software performance. Finds the balance between maintainable code and performance. Director at Zumba incentivize the whole team to contribute in open source projects and participate from meetups and conferences.
pt_br: Arquiteto e engenheiro que ama desempenho de software. Busca encontrar o equilíbrio entre desempenho e código de fácil manutenção. Diretor na Zumba, incentiva toda a sua equipe a contribuir para projetos open-source e a participar de conferências.

source: Kurita is a PHP programmer living in Tokyo. Currently he works in web application security. Joined CakePHP core team in February 2016 and has been working closely with the team on security fixes.
pt_br: Kurita é um programador PHP de Tóquio. Atualmente ele trabalha em segurança de aplicativos web. Juntou-se ao núcleo de desenvolvimento do CakePHP em fevereiro de 2016 e tem trabalhado com a equipe em correções de segurança.

source: Besides marketing, social media and community management, Megan is around to assist in general queries, community assistance and CakeFest planning.
pt_br: Além de marketing, social media e gestão da comunidade, Megan está por perto para auxiliar, em geral, consultas, assistência comunitária e planejamento da CakeFest.

source: CakePHP Community Manager
pt_br: Gerente da comunidade

source: Cakephp and Croogo core team member, surfer wannabe. Oh, I am Super Awesome too.
pt_br: Membro do núcleo de desenvolvimento do Croogo e do CakePHP, surfista wannabe. Ah, super incrível também.

source: Mathew is a programmer and 3D artist that enjoys contributing to open source projects. Joined CakePHP core team in October 2016 and has been working on database improvements. He has a programming blog at {0}, and is the creator of {1}
pt_br: Mathew é um programador e artista 3D que gosta de contribuir para projetos open-source. Juntou-se ao núcleo de desenvolvimento do CakePHP em outubro de 2016 e tem trabalhado na melhoria do banco de dados. Ele tem um blog de programação no {0} e é o criador de {1}
