Repository: cakephp/cakephp.org
Catalog: src/Locale/*/default.po
Languages: pt_br

source: CakePHP's code repositories are hosted at {0}.
pt_br: Os repositórios de código do CakePHP estão hospedados no {0}.

source: Security Issues
pt_br: Problemas de Segurança

source: Found a security exploit in CakePHP? Please don't message the mailing list, or open an issue on Github.
pt_br: Encontrou um exploit de segurança no CakePHP? Por favor, não exponha na lista de emails, ou abra uma issue no Github.

source: Instead, please email {0}.
pt_br: Em vez disso, por favor, envie uma mensagem para {0}.

source: Email sent to this address are forwarded to the maintainers of CakePHP.
pt_br: Mensagens enviadas para este endereço de e-mail são encaminhadas para os mantenedores do CakePHP.

source: When a security issue is reported, we first try to confirm the vulnerability.
pt_br: Quando é relatado um problema de segurança, primeiro tentamos confirmar a vulnerabilidade.

source: Once confirmed, we'll do the following:
pt_br: Uma vez confirmado, vamos fazer o seguinte:

source: Send acknowledgement to the reporter, that we received and confirmed the issue.
pt_br: Enviar a confirmação para o reportador, que recebemos e confirmamos a questão.

source: Work on a patch to fix the issue.
pt_br: Trabalhar em um patch para corrigir o problema.

source: Write a post describing the vulnerability, possible exploits and provide instructions on how to apply the patch / upgrade.
pt_br: Escrever um post descrevendo a vulnerabilidade, possíveis exploits e fornecer instruções sobre como aplicar o patch / atualização.

source: Apply the patch to all maintained and affected versions of CakePHP
pt_br: Aplicar o patch a todas as versões afetadas e mantidas do CakePHP.

source: Create new packaged releases for each affected version.
pt_br: Criar novos lançamentos para cada versão afetada.

source: Publish the post on the CakePHP blog/Bakery
pt_br: Publicar o post na Bakery do CakePHP.

source: Continuous Integration
pt_br: Integração contínua

source: CakePHP is {0} check the status of the {1} on Travis CI.
pt_br: O CakePHP é {0} checando o status das {1} no Travis CI.

source: continuously integrated
pt_br: continuamente integrado

source: various builds
pt_br: várias compilações

source: Found a bug? Suggest an improvement? Issue tracking for CakePHP can be found at {0}.
pt_br: Encontrou um bug? Quer sugerir uma melhoria? O rastreamento de issues do CakePHP pode ser encontrado em {0}.

source: Contributing
pt_br: Contribuindo

source: Contributing to CakePHP is easy.
pt_br: Contribuir com o CakePHP é fácil.

source: Checkout the {0} for how you can get started contributing to CakePHP.
pt_br: Verifique o {0} para se informar como você pode começar a contribuir com o CakePHP.

source: guide on contributing
pt_br: guia de contribuição

source: Version {0}
pt_br: Versão {0}

source: Back
pt_br: Voltar

source: CakePHP makes building web applications
pt_br: CakePHP faz a criação de aplicativos web

source: simpler, faster and require less code.
pt_br: mais simples, mais rápida e requer menos código.

source: Name
pt_br: Nome

source: Type
pt_br: Tipo

source: Email me
pt_br: Envie um email

source: Call me
pt_br: Faça uma ligação

source: Skype me
pt_br: Me procure no Skype

source: Phone
pt_br: Telefone

source: Subject
pt_br: Assunto

source: Send
pt_br: Enviar

source: Copyright 2005-2016 Cake Software Foundation, Inc. All rights reserved. {0}.
pt_br: Copyright 2005-2016 Cake Software Foundation, Inc. Todos os direitos reservados. {0}.

source: Designs by Ibaldo
pt_br: Designs por Ibaldo

source: Username
pt_br: Nome de usuário

source: Password
pt_br: Senha

source: Login
pt_br: Entrar

source: Remember me
pt_br: Lembrar-me

source: Forgot your password?
pt_br: Esqueceu sua senha?

source: New user?
pt_br: Novo usuário

source: Register!
pt_br: Registrar

source: Follow
pt_br: Seguir

source: Help & Support
pt_br: Ajuda & Suporte

source: Business Solutions
pt_br: Ofertas Comerciais

source: Showcase
pt_br: Galeria

source: Community
pt_br: Comunidade

source: Documentation
pt_br: Documentação

source: Get Paid to Write
pt_br: Autor Remunerado

source: Team
pt_br: Time

source: Logout
pt_br: Sair

source: DONATE
pt_br: DOE

source: Get Paid To Write
pt_br: Autor Remunerado

source: Help & Support
pt_br: Ajuda & Suporte

source: Language: {0}
pt_br: Idioma:

source: Submit
pt_br: Enviar

source: CakePHP More Stories
pt_br: Mais Casos

source: View more projects
pt_br: Ver mais projetos

source: CakePHP - Build fast, grow solid | Success Stories
pt_br: CakePHP - Build fast, grow solid | Histórias de Sucesso

source: CakePHP making building web applications simpler, faster and require less code. Success stories - how CakePHP has helped other companies to succeed.
pt_br: Como o CakePHP ajuda a outras empresas a alcançar o sucesso.

source: CakePHP Success Stories
pt_br: CakePHP Histórias de Sucesso

source: Here’s how CakePHP has helped other companies to succeed.
pt_br: Como CakePHP ajuda a outras empresas a alcançar o sucesso?

source: Code Review
pt_br: Revisão de Código

source: The following are some of the main reasons to review the existing source code on a project:
pt_br: A seguir estão alguns dos principais motivos para rever o código-fonte de um projeto existente:

source: You want to ensure the code quality from an external contractor
pt_br: Garantir a qualidade de código de um contratante externo

source: You feel your mission critical application could have scalability issues
pt_br: Você sente que seu aplicativo de missão crítica poderia ter problemas de escalabilidade

source: You are worried about potential security issues
pt_br: Você está preocupado com possíveis problemas de segurança

source: We provide the CakePHP code review to help you on these points, concrete examples of what to fix, the recommended steps to fix it, and the best enterprise practices. You know that good code quality pays off on the long run.
pt_br: Nós fornecemos a revisão de código da sua aplicação CakePHP a fim de ajudá-lo nesses pontos e muitos outros, demonstrando exemplos concretos do que corrigir, os passos recomendados para tal, e entregando as melhores práticas empresariais. Você sabe que qualidade de código compensa a longo prazo.

source: Service and Deliverables
pt_br: Análise Inteligente

source: Get a full featured CakePHP code review document containing:
pt_br: Receba documentos completos de revisão de código do CakePHP, incluindo:

source: Code quality review
pt_br: Análise de qualidade de código

source: CakePHP conventions and coding standards review
pt_br: Revisão de convenções e padrões de implementação do CakePHP

source: Scalability and performance code review
pt_br: Revisão de escalabilidade e desempenho de código

source: Re-use and best practices overview
pt_br: Reutilização e visão geral de melhores práticas de programação

source: Security code review
pt_br: Revisão de segurança na implementação do código

source: All covered in a structured easy to follow document:
pt_br: Tudo abordado em um documento estruturado e fácil de seguir:

source: Ready for your management team to evaluate the code status and risks
pt_br: Pronto para sua equipe de gestão avaliar o status do código e riscos

source: Ready for your development team to fix the current issues
pt_br: Pronto para sua equipe de desenvolvimento corrigir os problemas atuais

source: Trust the experts behind the CakePHP framework. Let us provide you piece of mind, and actively help you reduce technical debt and extend the longevity of your code base.
pt_br: Confie nos especialistas por trás do framework CakePHP. Permita-nos fornecer soluções inteligentes, auxiliar ativamente a reduzir déficits técnicos e a estender a longevidade do seu código.

source: Expert Consultancy
pt_br: Consultoria Especializada

source: Sometimes you need the extra experience and sound judgement to make the right decisions on your project. We can help with the areas which need special attention and a trained eye, allowing you to rest assured that you've got all bases covered.
pt_br: As vezes você precisa de avaliações críticas e experiência extra para tomar as decisões certas sobre seu projeto. Nós podemos ajudar a lidar com as demandas que necessitam de atenção especial e um olho treinado, permitindo que você tenha tranquilidade e certeza de estar bem assegurado e respaldado.

source: Specifications
pt_br: Especificações

source: A thorough requirements analysis is the most important step in any project's timeline. We'll listen to your needs and outline your project's specifications before development begins. Because applications must often change over time, our experts will also help to "future-proof" your project, planning for extension and ensuring simple maintenance down the road.
pt_br: Uma análise minuciosa de requisitos é o passo mais importante no cronograma de qualquer projeto. Vamos ouvir suas necessidades e as especificações do seu projeto desde o esboço, antes de começar o desenvolvimento. Devido às alterações constantes ao longo do tempo, nossos especialistas também ajudarão a prever o "futuro" do seu projeto, planejando o crescimento e garantindo a manutenção de forma simples no decorrer do tempo.

source: Migrations
pt_br: Migrações

source: If you need your current CakePHP application upgraded to the latest version of the framework then look no further than CakeDC. As the experts behind the framework we can handle a full migration of your existing code base, leaving you with an application which takes advantage of all the enhanced security features, performance benefits, and ready for the latest tech available for CakePHP.
pt_br: Se você precisa da sua aplicação atualizada para a versão mais recente do CakePHP, então pare de procurar agora, pois com a equipe da CakeDC, especialistas por trás do framework, podemos gerenciar a migração completa de seu código existente, entregando uma aplicação que tira proveito de todos os recursos avançados de segurança, benefícios de desempenho, e está pronta para as implementações tecnológicas mais recentes no CakePHP.

source: Give us a
pt_br: Nos faça uma

source: Call
pt_br: Ligação

source: For more information:
pt_br: Para mais informações:

source: Custom Development
pt_br: Desenvolvimento Personalizado

source: As the commercial entity behind the framework, and established by Larry Masters, founder of CakePHP, we know your project like no one else. From startups and social networks, to e-commerce and enterprise level applications, we provide the highest quality CakePHP development available.
pt_br: Como a entidade comercial por trás do framework, e criada por Larry Masters, fundador do CakePHP, conheçemos a fundação do seu projeto como ninguém. Nós fornecemos a mais alta qualidade no que tange desenvolvimento com o framework CakePHP, de startups e redes sociais, aplicações de nível empresarial a e-commerces.

source: Find out more
pt_br: Descubra mais

source: Why Choose CakeDC
pt_br: Porquê escolher a CakeDC

source: On-Demand Management
pt_br: Gerenciamento Sob Demanda

source: We've learned that transparency is key to successful collaborations, so all of our communication is out in the open, with evidence of our progress and results readily available.
pt_br: Nós aprendemos que transparência é a chave para colaborações de sucesso, logo, toda a nossa comunicação é feita a céu aberto, com evidência de nosso progresso e resultados prontamente disponíveis.

source: Milestone-Driven Development
pt_br: Desenvolvimento Baseado em Milestones

source: Our agile development cycles are based on milestones, which are designed to always be objective, focused and aim to provide a deliverable so you see your product in the making.
pt_br: Nossos ciclos de desenvolvimento ágil são baseados em metas, que são projetadas de forma a serem alcançáveis e objetivas, de forma que você veja o seu produto tomando forma.

source: Full QA Process
pt_br: Processo de QA Completo

source: We provide a QA process which is integrated directly into our development iterations, and that's based upon clear specifications and acceptance criteria which define our goals.
pt_br: Nós fornecemos um processo de controle de qualidade, que é integrado diretamente ao nossas iterações de desenvolvimento, baseadas em especificações claras e critérios de aceitação que definem nossos objetivos.

source: Unit Testing
pt_br: Testes Unitários

source: All of our work is fully testable by default, meaning that everything we deliver is provided in-hand with unit tests to validate our efforts and guarantee it's functionality.
pt_br: Todo o nosso trabalho é totalmente testável por padrão, o que significa que tudo o que entregamos é fornecido em conjunto com testes unitários para validar nossos esforços e garantir a funcionalidade.

source: Live Deployment
pt_br: Entrega Continua

source: During the development we offer a full continuous integration of your project to our private staging servers, which provides us essential insight into code quality, test coverage and impact areas.
pt_br: Durante o desenvolvimento, oferecemos integração continua completa de seu projeto para nossos servidores privados de publicação, o que nos fornece insights essenciais sobre qualidade de código, teste de cobertura e áreas de impacto.

source: Continuous Integration (CI) Environments
pt_br: Integração Contínua (CI)

source: We provide 3 managed environments to support our
pt_br: Nós fornecemos 3 ambientes gerenciados para suportar nosso

source: git workflow
pt_br: fluxo de trabalho no git

source: and ensure development, quality assurance and acceptance testing activities are isolated and visible to the client at all times. Deployment is automated, providing insight about the unit test coverage, code quality metrics and build status. Full automation and milestone based iterations provide a stable and predictable release cycle, reducing the overall time to market for the project and helping the Project Owners to successfully deliver their features as expected.
pt_br: assegurando o desenvolvimento e garantindo a qualidade. Atividades de testes de aceitação são isolados e visíveis para o cliente em todos os momentos. A implementação é automatizada, fornecendo uma visão ampla sobre a cobertura de testes unitários, métricas de qualidade de código e status de publicação. Automação completa e iterações de marco fornecem um ciclo de lançamento estável e previsível, reduzindo o tempo total até o lançamento no mercado e ajudando a entregar com sucesso suas características como esperado pelos proprietários do projeto.

source: What We Provide
pt_br: Soluções Comerciais

source: We offer an array of development services, each covered by years of experience and our collective talent.
pt_br: Oferecemos uma vasta gama de serviços de desenvolvimento, cada uma coberta por anos de experiência e nosso talento coletivo.

source: CakePHP Development
pt_br: Desenvolvimento com o CakePHP

source: Plugin Development
pt_br: Desenvolvimento de plugins

source: Mobile & Tablet Sites
pt_br: Sites mobile

source: API Development
pt_br: Desenvolvimento de API

source: Internationalization (i18n)
pt_br: Internacionalização (i18n)

source: Imports & Migrations
pt_br: Importações & Migrações

source: Third-Party Integrations
pt_br: Integrações

source: Project Management
pt_br: Gerenciamento de projetos

source: Issue & Bug Tracking
pt_br: Acompanhamento de issues & bugs

source: Backups & Version Control
pt_br: Versionamento & Backups

source: Database Modeling
pt_br: Modelagem de banco de dados

source: UML/ER/Flow Diagrams
pt_br: Diagramas UML/ER/Fluxo

source: In-Depth Code Review
pt_br: Revisão de código

source: Responsive Web Design
pt_br: Web design responsivo

source: Payment Gateways
pt_br: Gateways de pagamento

source: PCI Compliance
pt_br: Implementação PCI-DSS

source: Technical Specifications
pt_br: Especificações técnicas

source: Functional Analysis
pt_br: Análise funcional

source: Performance & Scalability
pt_br: Desempenho & Escalabilidade

source: Security & Integrity Checks
pt_br: Segurança & Integridade

source: Domain Level Analysis
pt_br: Análise em nível de domínio

source: Source Code Refactoring
pt_br: Refatoração de código fonte

source: Technical Documentation
pt_br: Documentação técnica

source: Web Standards Compliance
pt_br: Web standards

source: Usability Testing (UI & UX)
pt_br: Testes de usabilidade (UI & UX)

source: A/B Testing & Smoke Tests
pt_br: Testes A/B

source: Find out
pt_br: Descubra

source: More
pt_br: Mais

source: Looking to learn more about what CakeDC has to offer? Share your details with us below, and we'll contact you within {0}
pt_br: Quer saber o que a CakeDC tem a oferecer? Envie mais detalhes e nós entraremos em contato em até {0}

source: 24 hours!
pt_br: 24 horas!

source: Professional Training
pt_br: Treinamento Profissional

source: Without a fundamental knowledge of CakePHP conventions and the reasons they are used, even good programmers may write poor code. Learn the insights and reasoning behind the CakePHP framework straight from the minds behind the framework: the developers at CakeDC
pt_br: Sem conhecimento fundamentado sobre as convenções do CakePHP e as razões pelas quais são usadas, mesmo bons programadores podem escrever código ruim. Aprenda com a experiência e percepções das mentes por trás do framework: os desenvolvedores da CakeDC.

source: Training
pt_br: Treinamento

source: Our comprehensive training sessions teach the tools, knowledge, concepts and best-practices of CakePHP, helping your developers create code that is:
pt_br: Nossas sessões de treinamento ensinam sobre as ferramentas, conhecimento, conceitos e práticas recomendadas de desenvolvimento com o CakePHP, ajudando desenvolvedores a criar código que é:

source: Readable
pt_br: De fácil leitura

source: Maintainable
pt_br: De fácil manutenção

source: Extendable
pt_br: De fácil extensão

source: Object oriented
pt_br: Orientado a objetos

source: Our standard CakePHP training course is around 4-5 hours in duration, with a short pause mid-session. The course is accompanied by a live example application, and is conducted via video streaming and chat, where you'll have direct access to ask any questions necessary. So why not join us, and start enjoying the measurable, long-lasting benefits of expert code training today.
pt_br: Nosso curso padrão de formação do CakePHP gira em torno de 4 a 5 horas de duração, com uma breve pausa no meio da sessão. O curso é acompanhado através do desenvolvimento de uma aplicação ao vivo e é realizado via streaming de vídeo e bate-papo, onde você terá acesso direto a perguntas. Então porque não se juntar a nós e começar a aproveitar os benefícios mensuráveis de longa duração do treinamento ainda hoje?

source: Schedule
pt_br: Agenda

source: Visit the {0} site to view the scheduled courses which are currently available. Some sessions may already be at maximum capacity, and no longer have positions available for additional attendees. Sign ups are only valid for a session until 24 hours previous to the scheduled time.
pt_br: Visite o site de {0} para visualizar os cursos regulares que estão atualmente disponíveis. Algumas sessões podem já estar em sua capacidade máxima e já não têm posições disponíveis para participantes adicionais. Cadastros são válidos apenas para uma sessão em até 24 horas antes do horário agendado.

source: CakePHP Training
pt_br: Treinamento do CakePHP

source: Workshops and Custom Training
pt_br: Oficinas e treinamento personalizado

source: Don't forget to look out for {0} the annual CakePHP conference, where you can attend in person a live workshop presented by a core framework developer. Highly recommended for those who want to network with other CakePHP developers and meet the people behind the project.
pt_br: Não se esqueça de checar a {0}, a conferência anual do CakePHP, onde você pode assistir a um workshop ao vivo, apresentado por um desenvolvedor do framework em pessoa. Altamente recomendado para aqueles que querem aumentar seu rede de contato com outros desenvolvedores CakePHP e conhecer as pessoas por trás do projeto.

source: Additionally, if you'd prefer to have a more tailored training session for you or your team we can provide specific training sessions as part of our consultancy services, {0} us for more information.
pt_br: Além disso, se você preferir ter uma sessão de treinamento sob medida para você ou sua equipe, nós ofertamos sessões personalizadas como parte dos nossos serviços de consultoria, {0} nos para obter mais informações.

source: contact
pt_br: contate

source: Course Topics
pt_br: Tópicos do Curso

source: Setting up for development
pt_br: Configuração para desenvolvimento

source: CakePHP 2 project file structure
pt_br: Estrutura de arquivos de projetos do CakePHP 2/3

source: Framework configuration
pt_br: Configuração do framework

source: CakePHP 2 conventions
pt_br: Convenções do CakePHP 2/3

source: Baking your first project
pt_br: Assando seu primeiro projeto

source: Understanding scaffolding
pt_br: Entendendo o scaffolding

source: Using models
pt_br: Utilizando models

source: Model properties
pt_br: Propriedades de models

source: Model associations
pt_br: Associações de models

source: Model validation
pt_br: Validação de models

source: Retrieving data
pt_br: Recuperando dados

source: Saving your data
pt_br: Salvando dados

source: Creating controllers
pt_br: Criando controllers

source: Implementing callbacks
pt_br: Implementando callbacks

source: Request and Response objects
pt_br: Objetos de requisição e resposta

source: Building views
pt_br: Construindo views

source: Page layouts
pt_br: Layouts de páginas

source: Handling elements
pt_br: Manipulando elementos

source: Using plugins
pt_br: Utilizando plugins

source: Debugging code
pt_br: Depuração de código

source: Unit testing
pt_br: Testes unitários

source: Development
pt_br: Desenvolvimento

source: Consultancy
pt_br: Consultoria

source: Contact
pt_br: Contato

source: The Annual CakePHP Conference
pt_br: A Conferência Anual do CakePHP

source: Every year we hold a conference dedicated to CakePHP, hosting live workshops and inviting a variety of great speakers, to give you the very best in presentations and talks on the latest from the community:
pt_br: Todos os anos realizamos uma conferência dedicada ao CakePHP, realizando workshops ao vivo e convidando uma variedade de grandes palestrantes, para lhe proporcionar o melhor em apresentações e palestras sobre as últimas novidades da comunidade:

source: The workshops are a great way to learn CakePHP, and get up-to-date with the latest versions and innovations, directly from the core developers of the framework!
pt_br: As oficinas são uma ótima maneira de aprender mais e ficar atualizado sobre as últimas versões e inovações do CakePHP, diretamente dos principais desenvolvedores do framework!

source: The conference days are packed with presentations, discussions and talks on CakePHP and related technologies, an ideal moment to learn more from the community.
pt_br: Os dias da conferência são repletos de apresentações, discussões e palestras sobre CakePHP e tecnologias relacionadas, um momento ideal para aprender mais com a comunidade.

source: It's a great opportunity to network, meet friends old and new, and have some fun with the core members of the project. Plus, there's cake!
pt_br: É uma ótima oportunidade para estreitar sua rede de relacionamentos, encontrar amigos antigos e novos e se divertir com os membros do projeto. Além disso, há bolo!

source: More information on the conference and ticket sales can be found on the {0}
pt_br: Mais informações sobre a conferência e venda de tickets podem ser encontradas no {0}

source: CakeFest website
pt_br: website da CakeFest

source: Community Guidelines
pt_br: Guia de Conduta
